** atomselect 
"Atom selection is the primary method to access information about the
atoms in a molecule. It works in two steps. The first step is to
create a selection given the selection text, molecule id, and optional
frame number. This is done by a function called atomselect, which
returns the name of the new atom selection. the second step is to use
the created selection to access the information about the atoms in the
selections". See [fn:1].

Number of atoms
#+BEGIN_SRC tcl :noweb yes
<<sel>>
return [$sel num]
#+END_SRC

#+RESULTS:
: 10

List of indices
#+BEGIN_SRC tcl :noweb yes
<<sel>>
return [$sel list]
#+END_SRC

#+RESULTS:
: 0 1 2 3 4 5 6 7 8 9

Return text to create a selection
#+BEGIN_SRC tcl :noweb yes
<<sel>>
return [$sel text]
#+END_SRC

#+RESULTS:
: all

Set the frame for selection
#+BEGIN_SRC tcl :noweb yes
<<sel>>
$sel frame 4
return [$sel frame]
#+END_SRC

#+RESULTS:
: 4

get/set attribute
#+BEGIN_SRC tcl :noweb yes
<<sel>>
return [$sel get name]
#+END_SRC

#+RESULTS:
: A A A A A A A A A A


get list of bonds
#+BEGIN_SRC tcl :noweb yes
<<sel>>
return [$sel getbonds]
#+END_SRC

#+RESULTS:
: 1 {0 2} {1 3} {2 4} {3 5} {4 6} {5 7} {6 8} {7 9} 8

write selected atom to a file
#+BEGIN_SRC tcl :noweb yes :results silent
<<sel>>
set nf 1
$sel frame ${nf}
$sel writexyz data.xyz.${nf}
set nf 2
$sel frame ${nf}
$sel writexyz data.xyz.${nf}
#+END_SRC

*** A list of categories
#+BEGIN_SRC tcl :noweb yes
return [colorinfo categories]
#+END_SRC

#+RESULTS:
: Display Axes Name Type Element Resname Restype Chain Segname Conformation Molecule Highlight Structure Surface Labels Stage

*** A list of names for a given category (Display)
#+BEGIN_SRC tcl :noweb yes
return [colorinfo category Display]
#+END_SRC

#+RESULTS:
: Background BackgroundTop BackgroundBot Foreground FPS

*** A list of names for a given category (Name)
#+BEGIN_SRC tcl :noweb yes
return [colorinfo category Name]
#+END_SRC

#+RESULTS:
: H O N C S P Z LPA LPB

*** Get all categories and corresponding names
#+BEGIN_SRC tcl :noweb yes
  set clst [colorinfo categories]
  set otp ""
  foreach cname ${clst} {
      append otp "${cname}: [colorinfo category ${cname}] \n"
  }
  return ${otp}
#+END_SRC

#+RESULTS:
#+begin_example
Display: Background BackgroundTop BackgroundBot Foreground FPS 
Axes: X Y Z Origin Labels 
Name: H O N C S P Z LPA LPB 
Type: H O N C S P Z LP DRUD 
Element: X Ac Ag Al Am Ar As At Au B Ba Be Bh Bi Bk Br C Ca Cd Ce Cf Cl Cm Co Cr Cs Cu Db Ds Dy Er Es Eu F Fe Fm Fr Ga Gd Ge H He Hf Hg Ho Hs I In Ir K Kr La Li Lr Lu Md Mg Mn Mo Mt N Na Nb Nd Ne Ni No Np O Os P Pa Pb Pd Pm Po Pr Pt Pu Ra Rb Re Rf Rg Rh Rn Ru S Sb Sc Se Sg Si Sm Sn Sr Ta Tb Tc Te Th Ti Tl Tm U V W Xe Y Yb Zn Zr 
Resname: ALA ARG ASN ASP CYS GLY GLU GLN HIS ILE LEU LYS MET PHE PRO SER THR TRP TYR VAL ADE CYT GUA THY URA TIP TIP3 WAT SOL H2O LYR ZN NA CL HSE HSD HSP CYX 
Restype: Unassigned Solvent Nucleic_Acid Basic Acidic Polar Nonpolar Ion 
Chain:  
Segname:  
Conformation:  
Molecule:  
Highlight: Proback Nucback Nonback 
Structure: {Alpha Helix} 3_10_Helix Pi_Helix Extended_Beta Bridge_Beta Turn Coil 
Surface: Grasp 
Labels: Atoms Bonds Angles Dihedrals Springs 
Stage: Even Odd 
#+end_example

** TODO gettimestep
=gettimestep= returns garbage
#+BEGIN_SRC tcl :noweb yes
<<sel>>
set ts [gettimestep top 0]
return $ts
#+END_SRC

#+RESULTS:
: Display Axes Name Type Element Resname Restype Chain Segname Conformation Molecule Highlight Structure Surface Labels Stage

